{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "view-in-github"
   },
   "source": [
    "<a href=\"https://colab.research.google.com/github/corese-stack/corese-python/blob/develop/examples/example1.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "oCetcC1MQz13"
   },
   "source": [
    "# Using pycorese\n",
    "\n",
    "This notebook demonstrates how to use the **pycorese** package:\n",
    "\n",
    "- to load knowledge graph\n",
    "- to perform a SPARQL query\n",
    "- to validate a SHACL form\n",
    "- to access the classes of Corese Java API"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "tZjvQGgGe64i"
   },
   "source": [
    "## Install pycorese"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "nFeJr1PbQz18"
   },
   "source": [
    "Java Runtime Environment (JRE) 11 or higher is required to run **pycorese**.\n",
    "\n",
    "If you don't have Java installed please refer to the [official website](https://www.java.com/en/download/help/download_options.html) to download and install it."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "IKx255qaQz1_",
    "outputId": "29b40851-6439-459b-c5f5-1e8cb89f7e84"
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "openjdk version \"11.0.21\" 2023-10-17 LTS\n",
      "OpenJDK Runtime Environment Microsoft-8519785 (build 11.0.21+9-LTS)\n",
      "OpenJDK 64-Bit Server VM Microsoft-8519785 (build 11.0.21+9-LTS, mixed mode)\n"
     ]
    }
   ],
   "source": [
    "!java -version"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "QzKUfvL8Qz2G"
   },
   "source": [
    "**pycorese** is available on PyPI and can be installed using pip:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "OdY7kuBeQz2I",
    "outputId": "f0deca77-241c-4c58-970c-2906bcbc4078"
   },
   "outputs": [],
   "source": [
    "%pip install pycorese"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "pRlL21fgQz2M"
   },
   "source": [
    "Download the data files from the GitHub repository:\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "kOvrNs-ze64n",
    "outputId": "731259ca-8854-4497-fadc-aca4b4ec3714"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "beatles-validator.ttl\n",
      "beatles.rdf\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import sys\n",
    "if  not os.path.exists('./data/beatles.rdf'):\n",
    "    print('Downloading the data files...')\n",
    "    !mkdir -p ./data\n",
    "    !wget https://raw.githubusercontent.com/corese-stack/corese-python/main/examples/data/beatles.rdf -O ./data/beatles.rdf\n",
    "    !wget https://raw.githubusercontent.com/corese-stack/corese-python/main/examples/data/beatles-validator.ttl -O ./data/beatles-validator.ttl\n",
    "\n",
    "if sys.platform == 'win32':\n",
    "    !dir /b .\\data\\*.*\n",
    "else:\n",
    "    !ls ./data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "PLBixnURe64o"
   },
   "source": [
    "### Connect to Corese API\n",
    "\n",
    "Demonstrate loading and querying data with CoreseAPI connected through `Py4J` or `JPype` packages.  If you don't specify the java bridge type, the default is `Py4J`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "id": "wN4TDhjXe64p"
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-01-15 22:42:58,987 - INFO - Py4J: Loading CORESE...\n",
      "2025-01-15 22:43:02,334 - INFO - Py4J: CORESE is loaded\n"
     ]
    }
   ],
   "source": [
    "#%%timeit -n 1 -r 1\n",
    "from  pycorese.api import CoreseAPI\n",
    "\n",
    "python_to_java_bridge = 'py4j'\n",
    "corese = CoreseAPI(java_bridge=python_to_java_bridge)\n",
    "_ = corese.loadCorese()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'4.6.1'"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "corese.coreseVersion()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "7WzP7gCle64p"
   },
   "source": [
    "### High-level API"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "1hHYhnIve64p"
   },
   "source": [
    "#### Run SELECT query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 206
    },
    "id": "KiVYUBGhe64p",
    "outputId": "786d7754-23a2-4ba6-800d-e36bd199adc7"
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>p</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://example.com/Please_Please_Me</td>\n",
       "      <td>http://example.com/artist</td>\n",
       "      <td>http://example.com/The_Beatles</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://example.com/McCartney</td>\n",
       "      <td>http://example.com/artist</td>\n",
       "      <td>http://example.com/Paul_McCartney</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://example.com/Imagine</td>\n",
       "      <td>http://example.com/artist</td>\n",
       "      <td>http://example.com/John_Lennon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://example.com/Please_Please_Me</td>\n",
       "      <td>http://example.com/date</td>\n",
       "      <td>1963-03-22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://example.com/McCartney</td>\n",
       "      <td>http://example.com/date</td>\n",
       "      <td>1970-04-17</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               subject                          p  \\\n",
       "0  http://example.com/Please_Please_Me  http://example.com/artist   \n",
       "1         http://example.com/McCartney  http://example.com/artist   \n",
       "2           http://example.com/Imagine  http://example.com/artist   \n",
       "3  http://example.com/Please_Please_Me    http://example.com/date   \n",
       "4         http://example.com/McCartney    http://example.com/date   \n",
       "\n",
       "                                   o  \n",
       "0     http://example.com/The_Beatles  \n",
       "1  http://example.com/Paul_McCartney  \n",
       "2     http://example.com/John_Lennon  \n",
       "3                         1963-03-22  \n",
       "4                         1970-04-17  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "data_path = os.path.abspath('./data/beatles.rdf')\n",
    "\n",
    "query = '''\n",
    "SELECT *\n",
    "WHERE {?subject ?p ?o} LIMIT 5'''\n",
    "\n",
    "graph = corese.loadRDF(data_path)\n",
    "results = corese.sparqlSelect(graph, query=query, return_dataframe=True)\n",
    "\n",
    "results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "7iohNvoue64q"
   },
   "source": [
    "#### Load inference rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "0kzC2BXSe64q",
    "outputId": "67cdc27e-20b1-45ca-b045-a981abc2a6b5"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                     s                           type\n",
      "0  http://example.com/Please_Please_Me       http://example.com/Album\n",
      "1         http://example.com/McCartney       http://example.com/Album\n",
      "2           http://example.com/Imagine       http://example.com/Album\n",
      "3       http://example.com/The_Beatles        http://example.com/Band\n",
      "4       http://example.com/John_Lennon  http://example.com/SoloArtist\n",
      "5    http://example.com/Paul_McCartney  http://example.com/SoloArtist\n",
      "6       http://example.com/Ringo_Starr  http://example.com/SoloArtist\n",
      "7   http://example.com/George_Harrison  http://example.com/SoloArtist\n",
      "8        http://example.com/Love_Me_Do        http://example.com/Song\n",
      "Graph size:  29\n"
     ]
    }
   ],
   "source": [
    "corese.resetRuleEngine(graph)\n",
    "query = \"select * where {?s a ?type} order by ?type\"\n",
    "print(corese.sparqlSelect(graph, query=query))\n",
    "print(\"Graph size: \", graph.size())\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "SbSrRfsWe64q"
   },
   "source": [
    "Adding inference rules to the Corese engine should change the results of the query by adding new triples."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "op-vR8rge64q",
    "outputId": "4eb133de-a58c-43e0-9d90-04722db0f6b3"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph size:  33\n"
     ]
    }
   ],
   "source": [
    "corese.loadRuleEngine(graph, profile='rdfs')\n",
    "print(\"Graph size: \", graph.size())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "0ILJiiQJe64q"
   },
   "source": [
    "Let's see what was added."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "X_rFryste64q",
    "outputId": "b1f67902-a052-4075-f4d8-66ce54d0fefa"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                      s                           type\n",
      "0   http://example.com/Please_Please_Me       http://example.com/Album\n",
      "1          http://example.com/McCartney       http://example.com/Album\n",
      "2            http://example.com/Imagine       http://example.com/Album\n",
      "3        http://example.com/The_Beatles        http://example.com/Band\n",
      "4        http://example.com/John_Lennon      http://example.com/Person\n",
      "5     http://example.com/Paul_McCartney      http://example.com/Person\n",
      "6        http://example.com/Ringo_Starr      http://example.com/Person\n",
      "7    http://example.com/George_Harrison      http://example.com/Person\n",
      "8        http://example.com/John_Lennon  http://example.com/SoloArtist\n",
      "9     http://example.com/Paul_McCartney  http://example.com/SoloArtist\n",
      "10       http://example.com/Ringo_Starr  http://example.com/SoloArtist\n",
      "11   http://example.com/George_Harrison  http://example.com/SoloArtist\n",
      "12        http://example.com/Love_Me_Do        http://example.com/Song\n",
      "Graph size:  33\n"
     ]
    }
   ],
   "source": [
    "query = \"select * where {?s a ?type} order by ?type\"\n",
    "print(corese.sparqlSelect(graph, query=query))\n",
    "print(\"Graph size: \", graph.size())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "yvIlPQVue64r"
   },
   "source": [
    "The inference was that the solo artist is also a person although it was not explicitly stated in the data."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "enpoRBHve64r"
   },
   "source": [
    "#### Run CONSTRUCT query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "9Ii81qu1e64r",
    "outputId": "c2e57c03-f591-433f-ebfb-397f49a2519e"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<?xml version=\"1.0\"?>\n",
      "<rdf:RDF\n",
      "  xmlns:ex='http://example.com/'\n",
      "  xmlns:rdf='http://www.w3.org/1999/02/22-rdf-syntax-ns#'>\n",
      "\n",
      "  <ex:BandMember rdf:about='http://example.com/Ringo_Starr'>\n",
      "  </ex:BandMember>\n",
      "\n",
      "  <ex:BandMember rdf:about='http://example.com/John_Lennon'>\n",
      "  </ex:BandMember>\n",
      "\n",
      "  <ex:BandMember rdf:about='http://example.com/George_Harrison'>\n",
      "  </ex:BandMember>\n",
      "\n",
      "  <ex:BandMember rdf:about='http://example.com/Paul_McCartney'>\n",
      "  </ex:BandMember>\n",
      "\n",
      "</rdf:RDF>\n"
     ]
    }
   ],
   "source": [
    "construct = '''@prefix ex: <http://example.com/>\n",
    "              CONSTRUCT {?A_Beatle a ex:BandMember }\n",
    "              WHERE { ex:The_Beatles ex:member ?A_Beatle}'''\n",
    "\n",
    "results = corese.sparqlConstruct(graph, query=construct)\n",
    "\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "0PPF87F2e64r"
   },
   "source": [
    "By default, the CONSTRUCT query returns the RDF/XML format. For more concise format convert the results to Turtle."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "TULma6_Ce64r",
    "outputId": "88cd769a-f09f-49d4-f4cd-a0d031b73d60"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "<http://example.com/George_Harrison> a <http://example.com/BandMember> .\n",
      "\n",
      "<http://example.com/John_Lennon> a <http://example.com/BandMember> .\n",
      "\n",
      "<http://example.com/Paul_McCartney> a <http://example.com/BandMember> .\n",
      "\n",
      "<http://example.com/Ringo_Starr> a <http://example.com/BandMember> .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "ttl = corese.toTurtle(results)\n",
    "\n",
    "print(ttl)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "znZOJMz1e64r"
   },
   "source": [
    "#### Run SHACL form validation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "liQCAMpFe64s"
   },
   "source": [
    "In the example below, we will use the the SHACL shape file that validates that the *beatles* graph follows the rules:\n",
    "\n",
    "- A band has a name and at least on member who is also a Solo Artist\n",
    "- An album has one name, one date and one artist associated with it\n",
    "- A song has one name, one duration and at least writer and at least one performer associated with it\n",
    "\n",
    "The validation should fail because the *beatles* graph does not contain the required information.    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "MOsEDfB3e64s",
    "outputId": "1c2e0577-c583-41a2-f4da-50633daa5bee"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX ex: <http://example.com/>\n",
      "\n",
      "# Shape for Bands\n",
      "ex:BandShape a sh:NodeShape ;\n",
      "    sh:targetClass ex:Band ;\n",
      "    sh:property [\n",
      "        sh:path ex:name ;\n",
      "        sh:datatype xsd:string ;\n",
      "        sh:minCount 1 ;\n",
      "        sh:maxCount 1 ;\n",
      "    ] ;\n",
      "    sh:property [\n",
      "        sh:path ex:member ;\n",
      "        sh:class ex:SoloArtist ;\n",
      "        sh:minCount 1 ;\n",
      "    ] .\n",
      "\n",
      "# Shape for Solo Artists\n",
      "ex:SoloArtistShape a sh:NodeShape ;\n",
      "    sh:targetClass ex:SoloArtist .\n",
      "\n",
      "# Shape for Albums\n",
      "ex:AlbumShape a sh:NodeShape ;\n",
      "    sh:targetClass ex:Album ;\n",
      "    sh:property [\n",
      "        sh:path ex:name ;\n",
      "        sh:datatype xsd:string ;\n",
      "        sh:minCount 1 ;\n",
      "        sh:maxCount 1 ;\n",
      "    ] ;\n",
      "    sh:property [\n",
      "        sh:path ex:date ;\n",
      "        sh:datatype xsd:date ;\n",
      "        sh:minCount 1 ;\n",
      "        sh:maxCount 1 ;\n",
      "    ] ;\n",
      "    sh:property [\n",
      "        sh:path ex:artist ;\n",
      "        sh:nodeKind sh:IRI ;\n",
      "        sh:minCount 1 ;\n",
      "        sh:maxCount 1 ;\n",
      "    ] .\n",
      "\n",
      "# Shape for Songs\n",
      "ex:SongShape a sh:NodeShape ;\n",
      "    sh:targetClass ex:Song ;\n",
      "    sh:property [\n",
      "        sh:path ex:name ;\n",
      "        sh:datatype xsd:string ;\n",
      "        sh:minCount 1 ;\n",
      "        sh:maxCount 1 ;\n",
      "    ] ;\n",
      "    sh:property [\n",
      "        sh:path ex:length ;\n",
      "        sh:datatype xsd:integer ;\n",
      "        sh:minCount 1 ;\n",
      "        sh:maxCount 1 ;\n",
      "    ] ;\n",
      "        sh:property [\n",
      "        sh:path ex:performer ;\n",
      "        sh:nodeKind sh:IRI ;\n",
      "        sh:minCount 1 ;\n",
      "    ] ;\n",
      "    sh:property [\n",
      "        sh:path ex:writer ;\n",
      "        sh:nodeKind sh:IRI ;\n",
      "        sh:minCount 1 ;\n",
      "    ] .\n",
      "\n"
     ]
    }
   ],
   "source": [
    "data_shape_path = os.path.abspath('./data/beatles-validator.ttl')\n",
    "\n",
    "with open(data_shape_path, 'r') as file:\n",
    "    data_shape = file.read()\n",
    "    print(data_shape)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "Oa-7_Q_qe64s",
    "outputId": "d6764304-7a25-4274-d010-593cbbbbd5a2"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix xsh: <http://www.w3.org/ns/shacl#> .\n",
      "@prefix sh: <http://www.w3.org/ns/shacl#> .\n",
      "\n",
      "<urn:uuid:71004e6a-a24c-42b7-a2a9-0ac60198714f> a sh:ValidationResult ;\n",
      "  sh:focusNode <http://example.com/Love_Me_Do> ;\n",
      "  sh:resultMessage \"Fail at: [sh:minCount 1 ;\\r\\n  sh:nodeKind sh:IRI ;\\r\\n  sh:path <http://example.com/performer>]\" ;\n",
      "  sh:resultPath <http://example.com/performer> ;\n",
      "  sh:resultSeverity sh:Violation ;\n",
      "  sh:sourceConstraintComponent sh:MinCountConstraintComponent ;\n",
      "  sh:sourceShape _:b7 ;\n",
      "  sh:value 0 .\n",
      "\n",
      "[a sh:ValidationReport ;\n",
      "  sh:conforms false ;\n",
      "  sh:result <urn:uuid:71004e6a-a24c-42b7-a2a9-0ac60198714f>] .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "report = corese.shaclValidate(graph, shacl_shape_ttl=data_shape_path)\n",
    "\n",
    "print(report)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "ErOwy8yMe64s"
   },
   "source": [
    "The SHACL validation report is verbose and can be reshaped into a DataFrame for readability."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 184
    },
    "id": "K4_fQT0Ye64s",
    "outputId": "db9698e5-9f18-4714-ade4-93c6218b6047"
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>focusNode</th>\n",
       "      <th>resultMessage</th>\n",
       "      <th>resultPath</th>\n",
       "      <th>resultSeverity</th>\n",
       "      <th>sourceConstraintComponent</th>\n",
       "      <th>sourceShape</th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.w3.org/ns/shacl#ValidationResult</td>\n",
       "      <td>http://example.com/Love_Me_Do</td>\n",
       "      <td>Fail at: [sh:minCount 1 ;\r\n",
       "  sh:nodeKind sh:IR...</td>\n",
       "      <td>http://example.com/performer</td>\n",
       "      <td>http://www.w3.org/ns/shacl#Violation</td>\n",
       "      <td>http://www.w3.org/ns/shacl#MinCountConstraintC...</td>\n",
       "      <td>_:b9</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          type                      focusNode  \\\n",
       "0  http://www.w3.org/ns/shacl#ValidationResult  http://example.com/Love_Me_Do   \n",
       "\n",
       "                                       resultMessage  \\\n",
       "0  Fail at: [sh:minCount 1 ;\n",
       "  sh:nodeKind sh:IR...   \n",
       "\n",
       "                     resultPath                        resultSeverity  \\\n",
       "0  http://example.com/performer  http://www.w3.org/ns/shacl#Violation   \n",
       "\n",
       "                           sourceConstraintComponent sourceShape value  \n",
       "0  http://www.w3.org/ns/shacl#MinCountConstraintC...        _:b9     0  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "report_dataframe = corese.shaclReportToDataFrame(report)\n",
    "\n",
    "report_dataframe"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "d6xlzpURe64t"
   },
   "source": [
    "The report tells us that for the song *Love Me Do* a performer is not specified."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "Nt-rvV1Pe64t"
   },
   "source": [
    "## Low-level API"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "NgjIq4y-e64t"
   },
   "source": [
    "### Adding triples manually to the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "egIhirIce64t",
    "outputId": "5a78aacf-06fd-4968-ad8d-9a3f7ed96147"
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "JavaObject id=o40"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Namespace\n",
    "ex = \"http://example.com/\"\n",
    "\n",
    "# Get the graph from either Graph or DataManager objects\n",
    "graph = graph.getGraph()\n",
    "\n",
    "# Create and add statements: Help! is an album\n",
    "new_album_IRI = graph.addResource(ex + \"Help\")\n",
    "rdf_Type_Property = graph.addProperty(corese.Namespaces.RDF + 'type')\n",
    "album_type_IRI = graph.addResource(ex + \"Album\")\n",
    "\n",
    "graph.addEdge(new_album_IRI, rdf_Type_Property, album_type_IRI)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "BqmK5N5Xe64t"
   },
   "source": [
    "Let's see what was added."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "2l26SHjWe64u",
    "outputId": "87add254-e354-427b-b614-4863a0be45d4"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "01 ?album = <http://example.com/Please_Please_Me>; \n",
      "02 ?album = <http://example.com/McCartney>; \n",
      "03 ?album = <http://example.com/Imagine>; \n",
      "04 ?album = <http://example.com/Help>; \n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = f'''@prefix ex: <{ex}>\n",
    "            SELECT *\n",
    "            where {{?album a ex:Album }}'''\n",
    "\n",
    "exec = corese.QueryProcess.create(graph)\n",
    "\n",
    "results = exec.query(query)\n",
    "\n",
    "print(results)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "6IwJDXc4e64u"
   },
   "source": [
    "The new triple (album *Help*) was added to the graph."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "o41J9o5We64u"
   },
   "source": [
    "We can add some more detailes for the album *Help!* and see what was added."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "gSZwJp33e64u",
    "outputId": "f2ab11b3-a89e-4d38-b5d7-0c5b40d6f26f"
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "JavaObject id=o51"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create and add statement: The name of the album is actually Help!\n",
    "name_property_IRI = graph.addProperty(ex + \"name\")\n",
    "name_literal = graph.addLiteral(\"Help!\")\n",
    "\n",
    "graph.addEdge(new_album_IRI, name_property_IRI, name_literal)\n",
    "\n",
    "# Create and add statement: The new album was released in 1965\n",
    "xsd = \"http://www.w3.org/2001/XMLSchema#\"\n",
    "release_property_IRI = graph.addProperty(ex + \"date\")\n",
    "release_literal = graph.addLiteral(\"1965\", xsd + 'date')\n",
    "\n",
    "graph.addEdge(new_album_IRI, release_property_IRI, release_literal)\n",
    "\n",
    "\n",
    "# Create and add statement: The Beatles is the creator of the album Help\n",
    "artist_property_IRI = graph.addProperty(ex + \"artist\")\n",
    "artist_IRI = graph.addLiteral(ex + \"The_Beatles\")\n",
    "graph.addEdge(new_album_IRI, artist_property_IRI, artist_IRI)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "CTWzyXGUe64u",
    "outputId": "7e2a01bd-3884-4694-a3c5-005a56fd2b60"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "@prefix ex: <http://example.com/> .\n",
      "\n",
      "ex:Help ex:artist \"http://example.com/The_Beatles\" ;\n",
      "  ex:date \"1965\"^^xsd:date ;\n",
      "  ex:name \"Help!\" ;\n",
      "  a ex:Album .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = f'''@prefix ex: <{ex}>\n",
    "            CONSTRUCT {{ ?album ?p ?o }}\n",
    "            WHERE {{\n",
    "                VALUES ?album {{ ex:Help }}\n",
    "                ?album ?p ?o}} '''\n",
    "\n",
    "exec = corese.QueryProcess.create(graph)\n",
    "\n",
    "results = exec.query(query)\n",
    "\n",
    "results_ttl = corese.ResultFormat.create(results, corese.ResultFormat.TURTLE)\n",
    "\n",
    "print(results_ttl)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "provenance": [],
   "toc_visible": true
  },
  "kernelspec": {
   "display_name": "corese-python",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
